nrfconnect/sdk-nrf/drivers/wifi/nrf71/src/system/fmac_event.c
/*
 * Copyright (c) 2024 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */


/**
 * @brief File containing event specific definitions in the System mode
 * for the FMAC IF Layer of the Wi-Fi driver.
 */

#include <zephyr/init.h>
#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>
#include <common/fw_if/nrf71_wifi_ctrl.h>
#include <common/log_cfg.h>
#include <common/llist_mgmt.h>
#include <common/mem_mgmt.h>
#include <common/util.h>
#include <system/fmac_ap.h>
#include <system/fmac_event.h>
#include <system/fmac_peer.h>
#include <system/fmac_rx.h>
#include <system/fmac_tx.h>

LOG_MODULE_DECLARE(wifi_nrf, CONFIG_WIFI_NRF71_LOG_LEVEL);

#if defined(CONFIG_NRF71_TX_DONE_WQ_ENABLED)
K_THREAD_STACK_DEFINE(nrf_wifi_tx_done_wq_stack, CONFIG_NRF71_TX_DONE_WQ_STACK_SIZE);
struct k_work_q nrf_wifi_tx_done_wq;
#endif /* CONFIG_NRF71_TX_DONE_WQ_ENABLED */

#if defined(CONFIG_NRF71_RX_WQ_ENABLED)
K_THREAD_STACK_DEFINE(nrf_wifi_rx_wq_stack, CONFIG_NRF71_RX_WQ_STACK_SIZE);
struct k_work_q nrf_wifi_rx_wq;
#endif /* CONFIG_NRF71_RX_WQ_ENABLED */

static int nrf_wifi_work_queues_init(void)
{
#if defined(CONFIG_NRF71_TX_DONE_WQ_ENABLED)
	k_work_queue_init(&nrf_wifi_tx_done_wq);
	k_work_queue_start(&nrf_wifi_tx_done_wq,
			   nrf_wifi_tx_done_wq_stack,
			   K_THREAD_STACK_SIZEOF(nrf_wifi_tx_done_wq_stack),
			   CONFIG_NRF71_TX_DONE_WQ_PRIORITY,
			   NULL);
	k_thread_name_set(nrf_wifi_tx_done_wq.thread_id, "nrf71_tx_done_wq");
#endif /* CONFIG_NRF71_TX_DONE_WQ_ENABLED */

#if defined(CONFIG_NRF71_RX_WQ_ENABLED)
	k_work_queue_init(&nrf_wifi_rx_wq);
	k_work_queue_start(&nrf_wifi_rx_wq,
			   nrf_wifi_rx_wq_stack,
			   K_THREAD_STACK_SIZEOF(nrf_wifi_rx_wq_stack),
			   CONFIG_NRF71_RX_WQ_PRIORITY,
			   NULL);
	k_thread_name_set(nrf_wifi_rx_wq.thread_id, "nrf71_rx_wq");
#endif /* CONFIG_NRF71_RX_WQ_ENABLED */

	return 0;
}

SYS_INIT(nrf_wifi_work_queues_init, POST_KERNEL, 0);

#ifdef NRF71_SYSTEM_WITH_RAW_MODES
static enum nrf_wifi_status
nrf_wifi_fmac_if_mode_set_event_proc(struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx,
				     struct nrf_wifi_event_raw_config_mode *mode_event)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_SUCCESS;
	struct nrf_wifi_sys_fmac_dev_ctx *sys_dev_ctx;
	struct tx_config *config;
	struct nrf_wifi_fmac_vif_ctx *vif;
	unsigned char if_idx = mode_event->if_index;

	sys_dev_ctx = wifi_dev_priv(fmac_dev_ctx);
	config = &sys_dev_ctx->tx_config;
	vif = sys_dev_ctx->vif_ctx[if_idx];

	if (!mode_event->status) {
		vif->mode = mode_event->op_mode;
#ifdef NRF71_RAW_DATA_TX
		vif->txinjection_mode = false;
#endif /* NRF71_RAW_DATA_TX */
#ifdef NRF71_PROMISC_DATA_RX
		vif->promisc_mode = false;
#endif /* NRF71_PROMISC_DATA_RX */
		if ((mode_event->op_mode & NRF_WIFI_STA_MODE)
			== NRF_WIFI_STA_MODE) {
			mode_event->op_mode ^= NRF_WIFI_STA_MODE;
			vif->if_type = NRF_WIFI_IFTYPE_STATION;
			config->peers[MAX_PEERS].peer_id = -1;
			config->peers[MAX_PEERS].if_idx = -1;

#if defined(NRF71_RAW_DATA_TX) && defined(NRF71_PROMISC_DATA_RX)
			if ((mode_event->op_mode ^
			    (NRF_WIFI_PROMISCUOUS_MODE |
			     NRF_WIFI_TX_INJECTION_MODE)) == 0) {
				vif->if_type
					= NRF_WIFI_STA_PROMISC_TX_INJECTOR;
				config->peers[MAX_PEERS].peer_id
					= MAX_PEERS;
				config->peers[MAX_PEERS].if_idx
					= if_idx;
				vif->txinjection_mode = true;
				vif->promisc_mode = true;
			}
#endif /* NRF71_RAW_DATA_TX && defined NRF71_PROMISC_DATA_RX */
#ifdef NRF71_RAW_DATA_TX
			if ((mode_event->op_mode ^
			     NRF_WIFI_TX_INJECTION_MODE) == 0) {
				config->peers[MAX_PEERS].peer_id
					= MAX_PEERS;
				config->peers[MAX_PEERS].if_idx
					= if_idx;
				vif->if_type = NRF_WIFI_STA_TX_INJECTOR;
				vif->txinjection_mode = true;
			}
#endif /* NRF71_RAW_DATA_TX */
#ifdef NRF71_PROMISC_DATA_RX
			if ((mode_event->op_mode ^
			     NRF_WIFI_PROMISCUOUS_MODE) == 0) {
				vif->if_type = NRF_WIFI_STA_PROMISC;
				vif->promisc_mode = true;
			}
#endif /* NRF71_PROMISC_DATA_RX */
			goto out;
		}
#ifdef NRF71_RAW_DATA_RX
		if ((mode_event->op_mode & NRF_WIFI_MONITOR_MODE)
			== NRF_WIFI_MONITOR_MODE) {
			mode_event->op_mode ^= NRF_WIFI_MONITOR_MODE;
			vif->if_type = NRF_WIFI_IFTYPE_MONITOR;
			config->peers[MAX_PEERS].peer_id = -1;
			config->peers[MAX_PEERS].if_idx = -1;
#ifdef NRF71_RAW_DATA_TX
			if ((mode_event->op_mode ^
			     NRF_WIFI_TX_INJECTION_MODE) == 0) {
				config->peers[MAX_PEERS].peer_id
					= MAX_PEERS;
				config->peers[MAX_PEERS].if_idx
					= if_idx;
				vif->if_type = NRF_WIFI_MONITOR_TX_INJECTOR;
				vif->txinjection_mode = true;
			}
#endif
			goto out;
		}
#endif
	} else {
		LOG_ERR("%s: Set mode failed!",
				      __func__);
		status = NRF_WIFI_STATUS_FAIL;
	}
out:
	return status;
}
#endif /* NRF71_SYSTEM_WITH_RAW_MODES */


#ifdef NRF71_DATA_TX
static enum nrf_wifi_status
nrf_wifi_fmac_if_carr_state_event_proc(struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx,
				       unsigned char *umac_head,
				       enum nrf_wifi_fmac_if_carr_state carr_state)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_fmac_vif_ctx *vif_ctx = NULL;
	unsigned char if_idx = 0;
	struct nrf_wifi_sys_fmac_dev_ctx *sys_dev_ctx = NULL;
	struct nrf_wifi_sys_fmac_priv *sys_fpriv = NULL;

	sys_dev_ctx = wifi_dev_priv(fmac_dev_ctx);
	sys_fpriv = wifi_fmac_priv(fmac_dev_ctx->fpriv);

	if (!fmac_dev_ctx || !umac_head) {
		LOG_ERR("%s: Invalid parameters",
				      __func__);

		goto out;
	}

	if (!sys_fpriv->callbk_fns.if_carr_state_chg_callbk_fn) {
		LOG_DBG("%s: No callback handler registered",
				      __func__);

		status = NRF_WIFI_STATUS_SUCCESS;
		goto out;
	}

	if_idx = ((struct nrf_wifi_data_carrier_state *)umac_head)->wdev_id;

	if (if_idx >= MAX_NUM_VIFS) {
		LOG_ERR("%s: Invalid wdev_id recd from UMAC %d",
				      __func__,
				      if_idx);
		goto out;
	}

	vif_ctx = sys_dev_ctx->vif_ctx[if_idx];

	status = sys_fpriv->callbk_fns.if_carr_state_chg_callbk_fn(vif_ctx->os_vif_ctx,
									     carr_state);

	if (status != NRF_WIFI_STATUS_SUCCESS) {
		LOG_ERR("%s: IF carrier state change failed for VIF idx = %d",
				      __func__,
				      if_idx);
		goto out;
	}
out:
	return status;
}
#endif /* NRF71_DATA_TX */


static enum nrf_wifi_status umac_event_sys_stats_process(
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx,
	void *event)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_sys_umac_event_stats *stats = NULL;
	unsigned int recvd_len;
	unsigned int copy_len;

	if (!event) {
		LOG_ERR("%s: Invalid parameters",
				      __func__);
		goto out;
	}

	if (!fmac_dev_ctx->stats_req) {
		LOG_DBG("%s: Stats recd when req was not sent!",
				      __func__);
		status = NRF_WIFI_STATUS_SUCCESS;
		goto out;
	}

	stats = ((struct nrf_wifi_sys_umac_event_stats *)event);

	if (stats->sys_head.len < sizeof(stats->sys_head)) {
		LOG_ERR("%s: Malformed stats event, len=%u",
				      __func__, stats->sys_head.len);
		goto out;
	}

